{"timestamp": "2025-11-25T12:18:56.789945Z", "product_name": "Samsung 990 EVO SSD", "exporter_hs": null, "description": "컴퓨터 저장 장치용 솔리드 스테이트 드라이브, PCIe NVMe, 전자 저장 장치\n", "country_of_origin": "Korea", "candidates": [{"hts_code": "8471.70.40.65", "title": "Solid-state storage devices", "estimated_tariff_rate": "0%", "reason": "The product is explicitly an SSD (Solid State Drive) used for computer storage. This HTS code specifically covers solid-state storage devices under the category for storage units of automatic data processing machines (ADPMs).", "confidence": 98}, {"hts_code": "8471.70.40.60", "title": "Other storage units of automatic data processing machines", "estimated_tariff_rate": "0%", "reason": "If the specific subheading for solid-state devices (8471.70.40.65) was missed or if the device was considered a proprietary format not explicitly covered, it would fall under the residual classification for 'Other storage units' under 8471.70.40.", "confidence": 80}, {"hts_code": "8471.70.40.00", "title": "Magnetic, optical or other storage units", "estimated_tariff_rate": "0%", "reason": "This is the 8-digit parent heading for various storage units, including solid-state devices. While less specific than 8471.70.40.65, it accurately captures the functional description as a computer storage unit (excluding certain types of media).", "confidence": 75}, {"hts_code": "8473.30.51.00", "title": "Parts and accessories of the machines of heading 8471", "estimated_tariff_rate": "0%", "reason": "In the less likely event that the SSD is classified as merely a 'part' or 'accessory' rather than a distinct 'unit' of the ADPM, this residual HTS code for parts of computers would apply.", "confidence": 60}]}
{"timestamp": "2025-11-25T12:25:46.092167Z", "product_name": "삼성 990 EVO SSD", "exporter_hs": null, "description": "컴퓨터 저장 장치용 솔리드 스테이트 드라이브, PCIe NVMe, 전자 저장 장치\n", "country_of_origin": "Korea", "candidates": [{"hts_code": "8471.70.4065", "title": "Solid-state storage devices", "estimated_tariff_rate": "0%", "reason": "This HTS code specifically covers solid-state storage devices (SSDs) designed for use with automatic data processing machines, which perfectly matches the product description (Samsung 990 EVO SSD, PCIe NVMe).", "confidence": 98}, {"hts_code": "8471.70.6000", "title": "Other storage units", "estimated_tariff_rate": "0%", "reason": "This is a broader fallback code for storage units of ADP machines if the specific solid-state designation (8471.70.4065) is incorrectly overlooked or if a more general classification is sought within the 8471 storage heading.", "confidence": 85}, {"hts_code": "8473.30.5100", "title": "Other parts and accessories of the machines of heading 8471", "estimated_tariff_rate": "0%", "reason": "While an SSD is usually classified as a functional 'unit' under 8471.70, it could potentially be classified as a sophisticated 'part or accessory' of an ADP machine if the primary storage unit classification is rejected. This is a low-confidence alternative.", "confidence": 70}]}
{"timestamp": "2025-11-25T12:27:06.422730Z", "product_name": "삼성 990 EVO SSD", "exporter_hs": null, "description": "컴퓨터 저장 장치용 솔리드 스테이트 드라이브, PCIe NVMe, 전자 저장 장치\n", "country_of_origin": "KR", "candidates": [{"hts_code": "8471.70.4065", "title": "Solid-state storage devices", "estimated_tariff_rate": "0%", "reason": "This HTS code specifically covers solid-state storage devices (SSDs) designed for use with automatic data processing (ADP) machines, which precisely matches the Samsung 990 EVO SSD.", "confidence": 98}, {"hts_code": "8471.70.4090", "title": "Other storage units (other than magnetic disk, optical disk, tape, or solid-state)", "estimated_tariff_rate": "0%", "reason": "If the specific solid-state classification is disputed or not applicable for certain statistical uses, this residual code covers 'other' storage units under 8471.70.40.", "confidence": 80}, {"hts_code": "8471.70.4000", "title": "Storage units, other than magnetic disk storage units, optical disk storage units or tape storage units", "estimated_tariff_rate": "0%", "reason": "This is the 8-digit root classification encompassing all non-rotating and non-tape storage units, including solid-state devices.", "confidence": 90}, {"hts_code": "8473.30.5100", "title": "Parts and accessories of the machines of heading 8471, other", "estimated_tariff_rate": "0%", "reason": "Although an SSD functions as a dedicated storage unit (8471.70), this general heading is a common fallback for components and accessories of ADP machines if the item is incorrectly classified as a part rather than a complete unit.", "confidence": 75}]}
{"timestamp": "2025-11-25T12:27:57.071584Z", "product_name": "나이론 잠바", "exporter_hs": null, "description": "나이론 겨울 점퍼", "country_of_origin": "KR", "candidates": [{"hts_code": "6201.93.3000", "title": "Men's or boys' anoraks, windbreakers, and similar articles, outer shell 100% nylon or polyester", "estimated_tariff_rate": "0%", "reason": "This code covers men's non-knit anoraks or windbreakers made of 100% nylon (man-made fibers), which aligns with the description '나이론 겨울 점퍼' (Nylon winter jacket/jumper). The 0% rate is based on the US-Korea Free Trade Agreement (KFTA).", "confidence": 95}, {"hts_code": "6202.93.4500", "title": "Women's or girls' anoraks, windbreakers, and similar articles, outer shell 100% nylon or polyester", "estimated_tariff_rate": "0%", "reason": "Since the gender is not specified, this parallel code covers women's/girls' non-knit jackets/jumpers made of 100% nylon, consistent with the product description. Classification depends heavily on the intended wearer. The 0% rate applies due to KFTA.", "confidence": 95}, {"hts_code": "6201.93.4500", "title": "Men's or boys' overcoats, carcoats, etc., of man-made fibers, other", "estimated_tariff_rate": "0%", "reason": "If the article does not meet the definition of an anorak or ski-jacket, it would classify as an 'other' coat or jacket of man-made fibers (nylon). This serves as a secondary option for men's apparel. The 0% rate applies due to KFTA.", "confidence": 80}, {"hts_code": "6202.93.5000", "title": "Women's or girls' overcoats, carcoats, etc., of man-made fibers, other", "estimated_tariff_rate": "0%", "reason": "This is the parallel code for women's apparel if the item is determined to be a general jacket or coat of nylon, rather than specifically an anorak or ski-jacket. The 0% rate applies due to KFTA.", "confidence": 80}]}
{"timestamp": "2025-11-25T12:28:45.348579Z", "product_name": "컴퓨터 키보드", "exporter_hs": null, "description": "컴퓨터 블루투스 키보드", "country_of_origin": "KR", "candidates": [{"hts_code": "8471.60.2000", "title": "Input units for automatic data processing machines", "estimated_tariff_rate": "0%", "reason": "This is the primary classification for finished keyboards, which are considered input units for automatic data processing (ADP) machines, regardless of being wired or wireless (Bluetooth).", "confidence": 95}, {"hts_code": "8473.30.5100", "title": "Parts and accessories of the machines of heading 8471; other", "estimated_tariff_rate": "0%", "reason": "Less likely, as a finished keyboard is usually classified as a 'unit' (8471.60) rather than a 'part or accessory.' However, it is a common alternate classification error path.", "confidence": 70}, {"hts_code": "8517.62.0090", "title": "Machines for the reception, conversion and transmission or regeneration of voice, images or other data, other", "estimated_tariff_rate": "0%", "reason": "This code addresses the Bluetooth (wireless data transmission) functionality. However, Note 5(D) to Chapter 84 specifies that input units for ADP machines are classified under 8471, making this secondary.", "confidence": 60}]}
{"timestamp": "2025-11-25T12:29:01.898748Z", "product_name": "컴퓨터 키보드", "exporter_hs": null, "description": "컴퓨터 블루투스 키보드", "country_of_origin": "CN", "candidates": [{"hts_code": "8471.60.20.00", "title": "Keyboards (Input units of automatic data processing machines)", "estimated_tariff_rate": "0%", "reason": "This is the precise classification for keyboards, which are input units of automatic data processing machines, as specifically enumerated under subheading 8471.60.20.", "confidence": 100}, {"hts_code": "8471.80.90.00", "title": "Other units of automatic data processing machines", "estimated_tariff_rate": "0%", "reason": "This code serves as a residual category for units of ADP machines (computers) if they were not classified specifically as input/output units, though it is less specific than 8471.60.20.00.", "confidence": 85}, {"hts_code": "8517.62.00.90", "title": "Other apparatus for the transmission or reception of voice, images or other data, incorporating receiving apparatus", "estimated_tariff_rate": "0%", "reason": "Although Bluetooth capability technically involves radio transmission apparatus, HTS Legal Note 5(E) to Chapter 84 prioritizes classification based on the principal function (ADP input unit). This code would only apply if the device's principal function was determined to be data transmission rather than keyboard input.", "confidence": 55}]}
{"timestamp": "2025-11-25T12:29:17.006396Z", "product_name": "컴퓨터 키보드", "exporter_hs": null, "description": "컴퓨터 블루투스 키보드", "country_of_origin": "China", "candidates": [{"hts_code": "8471.60.1000", "title": "Input units, whether or not containing storage units in the same housing", "estimated_tariff_rate": "0%", "reason": "Keyboards are explicitly defined as input units for automatic data processing (ADP) machines under the provisions of Chapter 84, Note 5.", "confidence": 95}, {"hts_code": "8473.30.5100", "title": "Parts and accessories suitable for use solely or principally with the machines of heading 8471 (Other)", "estimated_tariff_rate": "0%", "reason": "Though the keyboard is a complete unit, this is a common secondary consideration code if the device were treated as an accessory or replaceable component rather than an essential 'unit' of the ADP system.", "confidence": 75}, {"hts_code": "8517.62.0090", "title": "Apparatus for the transmission or reception of voice, images, or other data (Other)", "estimated_tariff_rate": "0%", "reason": "This code might be considered mistakenly because the keyboard operates wirelessly via Bluetooth. However, its primary function is ADP input, which supersedes the communication function according to Chapter 84 legal notes.", "confidence": 60}]}
{"timestamp": "2025-11-25T12:29:44.000660Z", "product_name": "GPU ", "exporter_hs": null, "description": "컴퓨터그래픽카드", "country_of_origin": "China", "candidates": [{"hts_code": "8473.30.1180", "title": "Printed circuit assemblies (PCAs) for ADP machines, other than those incorporating a storage device, power supply, or motherboard", "estimated_tariff_rate": "0%", "reason": "A GPU, or graphics card, is a complex printed circuit assembly designed specifically for use solely or principally with automatic data processing machines (ADP). This sub-heading is generally the most precise classification for expansion cards.", "confidence": 95}, {"hts_code": "8471.80.1000", "title": "Units of automatic data processing machines, other than central processing units, input or output units; Control or adapter units", "estimated_tariff_rate": "0%", "reason": "A graphics card functions as a control or adapter unit, connecting the CPU processing functions to the visual output display, classifying it as an 'other unit' of an ADP machine.", "confidence": 90}, {"hts_code": "8473.30.9000", "title": "Parts and accessories for the machines of heading 8471, other than printed circuit assemblies, storage units, or input/output units", "estimated_tariff_rate": "0%", "reason": "A fallback classification for parts and accessories of ADP machines, if the card is determined not to meet the criteria for the PCA sub-heading 8473.30.1180.", "confidence": 75}, {"hts_code": "8542.31.0000", "title": "Electronic integrated circuits; Processors and controllers, whether or not incorporating memories, converters, logic circuits, amplifiers or other circuits", "estimated_tariff_rate": "0%", "reason": "This code classifies the Graphics Processing Unit (GPU) chip itself. While the product description implies the finished 'card,' the core function is derived from the processor, making this a classification possibility if the merchandise is deemed to be the processor component, rather than the assembled board.", "confidence": 60}]}
{"timestamp": "2025-11-25T12:30:45.402800Z", "product_name": "소고기", "exporter_hs": null, "description": "중국산 구이용 소고기", "country_of_origin": "China", "candidates": [{"hts_code": "0202.30.00.45", "title": "Frozen boneless beef, cuts of loin, short loin, and sirloin (excluding manufacturing quality)", "estimated_tariff_rate": "4.4%", "reason": "The product is described as 'grilling beef' (구이용), suggesting high-quality, specific cuts. Loin and sirloin cuts are premium boneless grilling steaks, and frozen is the most common state for specialized meat imports from China.", "confidence": 95}, {"hts_code": "0202.30.00.55", "title": "Frozen boneless beef, other cuts (excluding manufacturing quality)", "estimated_tariff_rate": "4.4%", "reason": "This code serves as a catch-all for other high-value boneless cuts used for grilling (e.g., specific cuts of flank, skirt steak, or processed short rib meat) that don't fit specifically under loin/sirloin.", "confidence": 85}, {"hts_code": "0201.30.00.40", "title": "Fresh or chilled boneless beef cuts, other than manufacturing quality", "estimated_tariff_rate": "4.4%", "reason": "This is the appropriate code if the beef is imported fresh or chilled instead of frozen. Grilling cuts are generally boneless for consumer convenience.", "confidence": 75}, {"hts_code": "0202.20.00.90", "title": "Frozen beef, other cuts with bone in (excluding manufacturing quality)", "estimated_tariff_rate": "2.2%", "reason": "If the grilling beef is imported bone-in (e.g., short ribs, T-bones, or bone-in ribeyes), this frozen bone-in classification would apply.", "confidence": 70}]}
{"timestamp": "2025-11-25T12:31:10.788654Z", "product_name": "소고기", "exporter_hs": null, "description": "중국산 구이용 냉동 소고기", "country_of_origin": "China", "candidates": [{"hts_code": "0202300050", "title": "Meat of bovine animals, frozen, boneless, other", "estimated_tariff_rate": "4.4¢/kg + 26.4% ad val.", "reason": "This is the general classification for frozen, boneless meat of bovine animals, suitable for grilling, when the specific cut or processing use is not specified.", "confidence": 90}, {"hts_code": "0202300040", "title": "Meat of bovine animals, frozen, boneless, suitable for processing", "estimated_tariff_rate": "4.4¢/kg + 26.4% ad val.", "reason": "If the 'grilling beef' is imported in large volumes or primal cuts destined for further breaking/processing (e.g., slicing for specific Asian-style BBQ), this manufacturing code may apply.", "confidence": 80}, {"hts_code": "0202200030", "title": "Cuts of meat of bovine animals, frozen, with bone in, other than forequarters", "estimated_tariff_rate": "4.4¢/kg + 26.4% ad val.", "reason": "If the grilling meat is imported as bone-in cuts (e.g., short ribs, T-bones, etc.), it would fall under HTS 0202.20. This subclass covers cuts other than forequarters.", "confidence": 75}]}
{"timestamp": "2025-11-25T13:06:40.985901Z", "product_name": "Samsung 990 EVO SSD", "exporter_hs": null, "description": "컴퓨터 저장 장치용 솔리드 스테이트 드라이브, PCIe NVMe, 전자 저장 장치\n", "country_of_origin": "Korea", "candidates": [{"hts_code": "8471.70.6000", "title": "Semiconductor storage units", "estimated_tariff_rate": "0%", "reason": "Solid State Drives (SSDs) are semiconductor storage units that function as peripherals or integrated components of automatic data processing (ADP) machines, classified under the 8471 storage unit provision.", "confidence": 95}, {"hts_code": "8542.32.0000", "title": "Electronic integrated circuits: Memories", "estimated_tariff_rate": "0%", "reason": "This classification applies to the core technology (NAND Flash memory ICs) used in the SSD. While 8471.70.60 is usually preferred for the functional drive unit, this chapter covers the underlying electronic memory component assembly.", "confidence": 80}, {"hts_code": "8471.70.9000", "title": "Other storage units", "estimated_tariff_rate": "0%", "reason": "This is the residual basket provision for storage units under 8471. If the product fails to meet the specific technical definition required for classification as a 'semiconductor storage unit' (8471.70.60), it would default here.", "confidence": 70}]}
{"timestamp": "2025-11-25T16:07:54.867479Z", "product_name": "Samsung 990 EVO SSD", "exporter_hs": null, "description": "컴퓨터 저장 장치용 솔리드 스테이트 드라이브, PCIe NVMe, 전자 저장 장치\n", "country_of_origin": "Korea", "candidates": [{"hts_code": "8471.70.6000", "title": "Solid-state drives (SSDs)", "estimated_tariff_rate": "0%", "reason": "This HTS code specifically covers Solid State Drives (SSDs) which function as storage units for automatic data processing machines (ADPMs), aligning perfectly with the product description (Samsung 990 EVO SSD).", "confidence": 100}, {"hts_code": "8471.70.9000", "title": "Other storage units for automatic data processing machines", "estimated_tariff_rate": "0%", "reason": "If the specific subheading 8471.70.60 was overlooked, the product is still correctly classified as an 'other storage unit' under HTS 8471.70, which covers functional input, output, or storage units of ADPMs.", "confidence": 90}, {"hts_code": "8523.51.0000", "title": "Solid-state non-volatile storage devices", "estimated_tariff_rate": "0%", "reason": "This subheading covers solid-state non-volatile storage devices (semiconductor media). While SSDs are assembled drives usually preferred in 8471, they are also fundamentally an assembly of solid-state storage media, making this a relevant, though secondary, classification option.", "confidence": 80}]}
{"timestamp": "2025-11-25T16:55:32.459225Z", "product_name": "Samsung 990 EVO SSD", "exporter_hs": null, "description": "컴퓨터 저장 장치용 솔리드 스테이트 드라이브, PCIe NVMe, 전자 저장 장치", "country_of_origin": "Korea", "candidates": [{"hts_code": "8523.51.0050", "title": "Other solid-state non-volatile storage devices (SSNVS devices)", "estimated_tariff_rate": "0%", "reason": "This is the specific 10-digit code for finished Solid State Drives (SSDs) utilizing flash technology, which are classified as semiconductor non-volatile storage media under Chapter 85.", "confidence": 95}, {"hts_code": "8523.51.0000", "title": "Semiconductor media, solid-state non-volatile storage devices", "estimated_tariff_rate": "0%", "reason": "This 8-digit heading covers all solid-state non-volatile storage devices (SSNVS), including SSDs. This classification takes precedence over general storage units in 8471.", "confidence": 90}, {"hts_code": "8471.70.9000", "title": "Other storage units of automatic data processing machines", "estimated_tariff_rate": "0%", "reason": "While SSDs are more specifically classified in 8523 as media, they function as a storage unit of an ADPM (8471). This is a common, though less precise, alternative classification.", "confidence": 65}, {"hts_code": "8473.30.5100", "title": "Parts and accessories suitable for use solely or principally with machines of heading 8471, other", "estimated_tariff_rate": "0%", "reason": "If the SSD is mistakenly viewed strictly as a part or component rather than a functional storage unit (8471.70) or media (8523), it might fall into the basket provision for ADP machine parts.", "confidence": 60}]}
{"timestamp": "2025-11-25T16:59:02.951952Z", "product_name": "Samsung 990 EVO SSD", "exporter_hs": null, "description": "컴퓨터 저장 장치용 솔리드 스테이트 드라이브, PCIe NVMe, 전자 저장 장치", "country_of_origin": "Korea", "candidates": [{"hts_code": "8471.70.40.65", "title": "Solid-state storage units", "estimated_tariff_rate": "0%", "reason": "This HTS code is specifically designated for finished Solid State Drives (SSDs) which function as storage units for automatic data processing machines (ADPMs). This is the most precise classification.", "confidence": 95}, {"hts_code": "8471.70.40", "title": "Semiconductor storage units, other than optical storage units", "estimated_tariff_rate": "0%", "reason": "This is the broader 8-digit heading covering storage units based on semiconductor technology, which applies if the more specific 10-digit code (8471.70.40.65) is unavailable or interpreted narrowly.", "confidence": 85}, {"hts_code": "8523.51.00", "title": "Semiconductor media, unrecorded, non-volatile", "estimated_tariff_rate": "0%", "reason": "Alternative classification if the SSD is viewed primarily as electronic storage media (flash memory components) rather than a functional unit of an ADPM (though 8471 is generally preferred for finished drives).", "confidence": 75}, {"hts_code": "8471.70.40.60", "title": "Other semiconductor storage units (other than solid-state storage units or those entered under 40.25)", "estimated_tariff_rate": "0%", "reason": "Fallback classification within the semiconductor storage unit category (8471.70.40) that covers units other than specifically defined solid-state drives, used if there is ambiguity regarding the 'solid-state storage unit' definition.", "confidence": 60}]}
{"timestamp": "2025-11-25T17:03:58.638532Z", "product_name": "면티셔츠", "exporter_hs": null, "description": "남자 면 티셔츠", "country_of_origin": "China", "candidates": [{"hts_code": "6109.10.00.20", "title": "T-shirts, knitted, of cotton, men's or boys'", "estimated_tariff_rate": "16.5%", "reason": "The product is identified as a T-shirt (likely knitted) made of cotton, and designated for men (남성). This is the primary classification based on material and gender.", "confidence": 95}, {"hts_code": "6109.90.10.00", "title": "T-shirts, knitted, of man-made fibers, men's or boys'", "estimated_tariff_rate": "32%", "reason": "Candidate if the product description '면' (cotton) is inaccurate and the fabric is predominantly composed of synthetic or man-made fibers (MMF), such as polyester or rayon.", "confidence": 70}, {"hts_code": "6109.10.00.40", "title": "T-shirts, knitted, of cotton, women's or girls'", "estimated_tariff_rate": "16.5%", "reason": "Candidate if the garment size/cut, despite being labeled '남자' (men's), fits standards usually classified as women's or girls' apparel for statistical reporting purposes.", "confidence": 60}, {"hts_code": "6205.20.20.00", "title": "Men's or boys' shirts, woven, of cotton, with a chest measurement of 38 cm or more", "estimated_tariff_rate": "11.5%", "reason": "Fallback classification if the garment is mistakenly identified as a T-shirt but is actually a simple woven shirt (not knitted) made of cotton. Chapter 62 covers woven apparel.", "confidence": 55}]}
{"timestamp": "2025-11-25T17:27:30.511548Z", "product_name": "면티셔츠", "exporter_hs": null, "description": "남자 면 티셔츠", "country_of_origin": "KR", "candidates": [{"hts_code": "6109.10.0020", "title": "Men's or boys' knitted T-shirts, of cotton", "estimated_tariff_rate": "0%", "reason": "Product is a Men's cotton t-shirt (면티셔츠). This 10-digit code specifically covers knitted cotton T-shirts for men or boys. KORUS FTA applies 0% duty.", "confidence": 95}, {"hts_code": "6109.10.00", "title": "Knitted T-shirts, singlets, and other vests, of cotton (8-digit)", "estimated_tariff_rate": "0%", "reason": "Covers all cotton T-shirts and singlets, regardless of gender classification, confirming the material and garment type. KORUS FTA rate is 0%.", "confidence": 85}, {"hts_code": "6109.10.0010", "title": "Women's or girls' knitted T-shirts, of cotton", "estimated_tariff_rate": "0%", "reason": "Included as a close alternative in case the classification of gender (men's vs. women's) is reversed or incorrect during customs entry. KORUS FTA rate is 0%.", "confidence": 70}, {"hts_code": "6114.20.0080", "title": "Other garments, knitted or crocheted, of cotton", "estimated_tariff_rate": "0%", "reason": "A broader 'catch-all' code for knit cotton garments, used only if the item fails the criteria for a standard T-shirt under 6109 (e.g., if it has features defining it as a specialized shirt). KORUS FTA rate is 0%.", "confidence": 55}]}
{"timestamp": "2025-11-25T17:49:10.031595Z", "product_name": "Samsung 990 EVO SSD", "exporter_hs": null, "description": "컴퓨터 저장 장치용 솔리드 스테이트 드라이브, PCIe NVMe, 전자 저장 장치", "country_of_origin": "Korea", "candidates": [{"hts_code": "8523.51.0000", "title": "Solid-state non-volatile storage devices", "estimated_tariff_rate": "0%", "reason": "This HTS code specifically covers solid-state non-volatile storage devices (SSDs), offering the most precise classification for the product under GRI 3(a).", "confidence": 95}, {"hts_code": "8471.70.6000", "title": "Storage units, other than magnetic or optical, for automatic data processing machines", "estimated_tariff_rate": "0%", "reason": "SSDs are also considered storage units for automatic data processing (ADP) machines. This classification is often used by importers as an appropriate secondary option for ADP storage units that are not magnetic (HDD) or optical.", "confidence": 85}, {"hts_code": "8471.70.9000", "title": "Other storage units, not elsewhere specified in 8471.70", "estimated_tariff_rate": "0%", "reason": "This is a residual subheading within the primary ADP storage heading (8471.70), potentially covering storage devices if they are deemed not sufficiently covered by the more specific 8471.70.6000 designation.", "confidence": 75}]}
{"timestamp": "2025-11-25T18:36:50.468146Z", "product_name": "남자 면티", "exporter_hs": null, "description": "남자 검전색 반팔 면티", "country_of_origin": "korea", "candidates": [{"hts_code": "6109.10.0012", "title": "Men's or boys' T-shirts, knitted or crocheted, of cotton", "estimated_tariff_rate": "0%", "reason": "This is the specific US HTS code for men's cotton knit T-shirts. The 0% rate is based on the US-Korea Free Trade Agreement (KORUS). General rate is 16.5%.", "confidence": 95}, {"hts_code": "6109.10.00", "title": "T-shirts, singlets, tank tops, and similar garments, knitted or crocheted, of cotton", "estimated_tariff_rate": "0%", "reason": "General 8-digit heading for all cotton knit T-shirts, regardless of gender. Appropriate if the specific 10-digit classification is less certain. Tariff is 0% under KORUS.", "confidence": 85}, {"hts_code": "6110.20.2078", "title": "Sweaters, pullovers, knitted or crocheted, of cotton, men's or boys'", "estimated_tariff_rate": "0%", "reason": "Used as an alternative in case the garment is mistakenly considered a lightweight cotton pullover or knit shirt (not strictly a T-shirt). Low confidence, but category 6110 is for other cotton knit outerwear.", "confidence": 60}]}
{"timestamp": "2025-11-25T18:38:00.613592Z", "product_name": "옥수수", "exporter_hs": null, "description": "껍질을 까지 않고 조리되지않은 날것의 옥수수", "country_of_origin": "China", "candidates": [{"hts_code": "0709.93.0000", "title": "Maize (corn), fresh or chilled", "estimated_tariff_rate": "0%", "reason": "The description implies raw, fresh/chilled corn on the cob (unshelled), which is classified as a vegetable under Chapter 7.", "confidence": 95}, {"hts_code": "1005.90.4000", "title": "Other maize (corn) (excluding seed corn and popcorn)", "estimated_tariff_rate": "0%", "reason": "If the corn is dry field corn intended as grain or animal feed, it falls under Chapter 10 as a cereal.", "confidence": 85}, {"hts_code": "0710.40.0000", "title": "Sweet corn, uncooked or cooked by steaming or boiling in water, frozen", "estimated_tariff_rate": "14.9%", "reason": "If the product is fresh sweet corn that has been prepared (shelled) and preserved by freezing. Note: the high tariff rate applies to frozen sweet corn (HS 0710.40).", "confidence": 70}, {"hts_code": "1005.90.3000", "title": "Popcorn", "estimated_tariff_rate": "0%", "reason": "If the corn is identified specifically as dried popcorn kernels, it is classified here as a specific type of cereal grain.", "confidence": 65}]}
{"timestamp": "2025-11-25T18:45:49.046610Z", "product_name": "옥수수", "exporter_hs": null, "description": "껍질을 까지 않고 조리되지않은 날것의 옥수수", "country_of_origin": "중국", "candidates": [{"hts_code": "0709.99.2000", "title": "Sweet corn, fresh or chilled", "estimated_tariff_rate": "0%", "reason": "The product is described as raw, uncooked, and unhusked ('껍질을 까지 않고'), which strongly suggests fresh sweet corn on the cob, classified as an edible vegetable under Chapter 7.", "confidence": 95}, {"hts_code": "1005.90.4000", "title": "Maize (corn): Other than seed corn: Yellow dent corn", "estimated_tariff_rate": "0%", "reason": "If the corn is field corn (commodity corn) and not intended for immediate consumption as a vegetable, it is classified as a cereal grain under Chapter 10. Yellow dent corn is the most common variety imported for feed or processing.", "confidence": 85}, {"hts_code": "1005.90.6000", "title": "Maize (corn): Other than seed corn, yellow dent corn, or popcorn", "estimated_tariff_rate": "0%", "reason": "This is the residual classification for all other varieties of commodity grain corn (e.g., white corn or non-dent types) if the classification falls under Chapter 10, Cereal Grains.", "confidence": 75}, {"hts_code": "1005.90.2000", "title": "Maize (corn): Popcorn", "estimated_tariff_rate": "0%", "reason": "If the product is specifically the variety of maize used for popping, it falls here. Popcorn is typically imported in the raw, unshelled, dry grain form.", "confidence": 60}]}
{"timestamp": "2025-11-25T18:50:30.420177Z", "product_name": "Samsung 990 EVO SSD", "exporter_hs": null, "description": "Solid-state drive for computer storage, PCIe NVMe, electronic storage device", "country_of_origin": "한국", "candidates": [{"hts_code": "8471.70.4000", "title": "Solid state storage devices (SSDs)", "estimated_tariff_rate": "0%", "reason": "This HTS code is specifically designed for Solid State Drives (SSDs), which are defined as storage units for automatic data processing machines (ADP). This is the most accurate classification based on GRI 1.", "confidence": 95}, {"hts_code": "8471.70.6000", "title": "Other storage units (magnetic, optical, or other media)", "estimated_tariff_rate": "0%", "reason": "This is a broader catch-all category for storage units under 8471, applicable if the specific SSD subheading (8471.70.40) was overlooked, although less precise.", "confidence": 80}, {"hts_code": "8473.30.5100", "title": "Other parts and accessories suitable for use solely or principally with machines of heading 8471", "estimated_tariff_rate": "0%", "reason": "While an SSD is correctly classified as a 'unit' under 8471.70, it could potentially be misclassified as a 'part' of an ADP machine. This is a common secondary error path.", "confidence": 65}]}
{"timestamp": "2025-11-25T18:52:19.708364Z", "product_name": "검정티셔츠", "exporter_hs": null, "description": "반팔 면 검정티셔츠", "country_of_origin": "Korea", "candidates": [{"hts_code": "6109.10.0012", "title": "Men's or boys' T-shirts, singlets, tank tops and similar garments, knitted or crocheted, of cotton", "estimated_tariff_rate": "16.5%", "reason": "Product is a short-sleeved cotton T-shirt, which falls under Chapter 61 (knitted) and subheading 6109.10 (of cotton). This specific code covers men's items.", "confidence": 95}, {"hts_code": "6109.10.0022", "title": "Women's or girls' T-shirts, singlets, tank tops and similar garments, knitted or crocheted, of cotton", "estimated_tariff_rate": "16.5%", "reason": "Classification for knitted cotton T-shirts (6109.10); selected to cover the possibility that the shipment is destined for the women's market, as gender was not specified in the input.", "confidence": 95}, {"hts_code": "6109.10.0019", "title": "Boys' cotton T-shirts, knitted or crocheted", "estimated_tariff_rate": "16.5%", "reason": "If the T-shirts are sized and marketed for boys, this code applies. It remains within the principal cotton T-shirt heading (6109.10).", "confidence": 80}, {"hts_code": "6109.90.1000", "title": "T-shirts, singlets, tank tops, etc., knitted or crocheted, of man-made fibers", "estimated_tariff_rate": "32%", "reason": "Fallback option if the 'cotton (면)' description is inaccurate or if the item is a blend primarily composed of man-made fibers (MMF) which would push it into the other materials category (6109.90).", "confidence": 60}]}
{"timestamp": "2025-11-25T19:01:39.864373Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지않은 날것의 옥수수", "country_of_origin": "China", "candidates": [{"hts_code": "1005.90.6000", "title": "Maize (corn), other than seed corn, other than popcorn", "estimated_tariff_rate": "0%", "reason": "This is the primary classification for raw, uncooked field corn or dent corn, which is the most common form of imported maize that is not seed or popcorn.", "confidence": 95}, {"hts_code": "1005.90.4000", "title": "Popcorn", "estimated_tariff_rate": "0%", "reason": "If the uncooked maize is specifically a variety intended for popping, it must be classified here. This is a common commercial distinction within Heading 1005.", "confidence": 85}, {"hts_code": "1005.10.0000", "title": "Maize (corn) for sowing (seed corn)", "estimated_tariff_rate": "0%", "reason": "If the raw corn is imported specifically for planting/sowing purposes, it falls under this subheading, which distinguishes it from corn intended for consumption or feed.", "confidence": 75}, {"hts_code": "0709.99.6000", "title": "Other fresh or chilled vegetables, sweet corn", "estimated_tariff_rate": "2.5¢/kg", "reason": "Although corn is generally a cereal (Chapter 10), if the product is fresh sweet corn on the cob (often treated as a vegetable), this heading applies. Confidence is lower as the description '옥수수' usually implies bulk maize kernels.", "confidence": 60}]}
{"timestamp": "2025-11-25T19:03:12.862115Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지않은 날것의 옥수수", "country_of_origin": "China", "candidates": [{"hts_code": "1005.90.40", "title": "Maize (corn), dent corn, other than seed corn", "estimated_tariff_rate": "0%", "reason": "This HTS covers bulk raw corn that is categorized as dent corn, which is the most common industrial and feed type of maize imported.", "confidence": 90}, {"hts_code": "1005.90.90", "title": "Maize (corn), other (including flint, etc.), other than seed corn or popcorn", "estimated_tariff_rate": "0%", "reason": "Used if the raw corn is not dent corn, popcorn, or seed corn (e.g., flint corn or unclassified bulk grain). This acts as a general residual category for bulk maize.", "confidence": 85}, {"hts_code": "0709.93.00", "title": "Other vegetables, fresh or chilled: Sweet corn", "estimated_tariff_rate": "0%", "reason": "If the term 'raw' (날것의) refers to fresh or chilled sweet corn, typically on or off the cob, intended for immediate consumption or freezing/canning, it would classify under Chapter 7.", "confidence": 70}, {"hts_code": "1005.10.00", "title": "Maize (corn), seed corn", "estimated_tariff_rate": "0%", "reason": "Applicable only if the corn is certified and imported specifically for the purpose of planting and propagation.", "confidence": 50}]}
{"timestamp": "2025-11-25T19:13:04.406406Z", "product_name": "옥수수", "exporter_hs": null, "description": "날것의 조리되지않은 옥수수", "country_of_origin": "중국", "candidates": [{"hts_code": "1005.90.40", "title": "Maize (corn), other than seed corn, yellow dent corn", "estimated_tariff_rate": "0%", "reason": "This is the primary classification for raw, dried bulk corn (maize) traded internationally as a cereal grain.", "confidence": 90}, {"hts_code": "1005.90.60", "title": "Maize (corn), other than seed corn, yellow dent corn, or popcorn", "estimated_tariff_rate": "0%", "reason": "Appropriate if the raw, dried corn is a variety other than yellow dent (e.g., white corn or specific feed corn).", "confidence": 85}, {"hts_code": "0709.99.20", "title": "Sweet corn, fresh or chilled", "estimated_tariff_rate": "0%", "reason": "If the 'raw, uncooked corn' refers specifically to sweet corn intended for consumption as a fresh vegetable (corn on the cob or fresh kernels).", "confidence": 75}, {"hts_code": "0710.40.00", "title": "Sweet corn, frozen", "estimated_tariff_rate": "14.9%", "reason": "If the raw corn is harvested as sweet corn (a vegetable) and imported in a frozen state.", "confidence": 70}]}
{"timestamp": "2025-11-25T20:36:51.217924Z", "product_name": "면티셔츠", "exporter_hs": null, "description": "검정 반팔 면티셔츠", "country_of_origin": "한국", "candidates": [{"hts_code": "6109.10.0020", "title": "T-shirts, of cotton, knitted or crocheted: Men's or boys'", "estimated_tariff_rate": "0%", "reason": "Classification for a knitted cotton T-shirt, men's or boys'. The US Harmonized Tariff Schedule (HTS) 'KR' rate is 0% due to the KORUS Free Trade Agreement (FTA), provided the article meets rules of origin.", "confidence": 95}, {"hts_code": "6109.10.0035", "title": "T-shirts, of cotton, knitted or crocheted: Women's or girls'", "estimated_tariff_rate": "0%", "reason": "Primary classification for a knitted cotton T-shirt, women's or girls'. The US HTS 'KR' rate is 0% due to the KORUS FTA.", "confidence": 95}, {"hts_code": "6109.10.0040", "title": "T-shirts, of cotton, knitted or crocheted: Other (Not Men's, Boys', Women's, or Girls')", "estimated_tariff_rate": "0%", "reason": "Used for infant or small children's cotton T-shirts. The US HTS 'KR' rate is 0% due to the KORUS FTA.", "confidence": 85}, {"hts_code": "6109.90.1010", "title": "T-shirts, of man-made fibers, knitted or crocheted: Men's or boys'", "estimated_tariff_rate": "0%", "reason": "Alternative classification if the material is not predominantly cotton but is composed of man-made fibers (e.g., polyester). The US HTS 'KR' rate is 0% due to the KORUS FTA.", "confidence": 75}]}
{"timestamp": "2025-11-25T20:36:54.043798Z", "product_name": "면티셔츠", "exporter_hs": null, "description": "검정 반팔 면티셔츠", "country_of_origin": "한국", "candidates": [{"hts_code": "6109.10.0008", "title": "T-shirts, knitted, of cotton, men's or boys'", "estimated_tariff_rate": "0%", "reason": "The product is a short-sleeved cotton T-shirt (검정 반팔 면티셔츠) falling under HTS 6109.10 (Of cotton). This code covers the classification for men's or boys' garments. Tariff is 0% under the KORUS FTA.", "confidence": 95}, {"hts_code": "6109.10.0004", "title": "T-shirts, knitted, of cotton, women's or girls'", "estimated_tariff_rate": "0%", "reason": "The product description does not specify gender. This code covers identical garments made of cotton for women or girls. Tariff is 0% under the KORUS FTA.", "confidence": 95}, {"hts_code": "6109.90.1000", "title": "T-shirts, knitted, of other textile materials (man-made fibers)", "estimated_tariff_rate": "0%", "reason": "Applicable if the garment is a cotton blend where man-made fibers (MMF) predominate by weight (or if the description '면' was used loosely for a non-cotton garment). Tariff is 0% under the KORUS FTA.", "confidence": 65}]}
{"timestamp": "2025-11-25T20:36:54.259987Z", "product_name": "면티셔츠", "exporter_hs": null, "description": "검정 반팔 면티셔츠", "country_of_origin": "한국", "candidates": [{"hts_code": "6109.10.00.20", "title": "Knitted T-shirts, of cotton, men's or boys'", "estimated_tariff_rate": "0%", "reason": "This code covers knitted (standard T-shirt construction) short-sleeved shirts made of cotton ('면티셔츠'). This is the standard classification assuming it is men's/boys' sizing. Tariff rate is 0% due to the US-Korea FTA (KORUS).", "confidence": 95}, {"hts_code": "6109.10.00.40", "title": "Knitted T-shirts, of cotton, women's or girls'", "estimated_tariff_rate": "0%", "reason": "This is the identical classification to the previous candidate, but for women's or girls' sizing. Since the gender is not specified in the description, both codes under 6109.10 must be considered. Tariff rate is 0% (KORUS).", "confidence": 95}, {"hts_code": "6109.90.10.60", "title": "Knitted T-shirts, of synthetic fibers, men's or boys'", "estimated_tariff_rate": "0%", "reason": "Used as a backup candidate if the T-shirt is actually made of a synthetic fiber blend (e.g., polyester or nylon) but marketed generically as 'T-shirt' or if the cotton content is insufficient for 6109.10 classification. Tariff rate is 0% (KORUS).", "confidence": 70}]}
{"timestamp": "2025-11-25T20:36:57.946975Z", "product_name": "면티셔츠", "exporter_hs": null, "description": "검정 반팔 면티셔츠", "country_of_origin": "한국", "candidates": [{"hts_code": "6109.10.0010", "title": "T-shirts, of cotton, men's or boys'", "estimated_tariff_rate": "0%", "reason": "The product is a short-sleeved cotton T-shirt, which falls under Chapter 61 (knitted/crocheted apparel) and heading 6109 (T-shirts, of cotton). The 10-digit code assumes men's or unisex sizing. Rate is 0% under KORUS.", "confidence": 95}, {"hts_code": "6109.10.0020", "title": "T-shirts, of cotton, women's or girls'", "estimated_tariff_rate": "0%", "reason": "This is the identical classification to 6109.10.0010 but covers the gender split (women's/girls') required at the 10-digit level, as the input description did not specify gender. Rate is 0% under KORUS.", "confidence": 95}, {"hts_code": "6109.90.1000", "title": "T-shirts, of man-made fibers", "estimated_tariff_rate": "0%", "reason": "Candidate if the classification of 'cotton' (면) is inaccurate, and the shirt is actually majority synthetic/man-made fibers (e.g., polyester or rayon). Still within the correct primary heading (6109). Rate is 0% under KORUS.", "confidence": 70}, {"hts_code": "6114.20.0080", "title": "Other knitted or crocheted garments, of cotton", "estimated_tariff_rate": "0%", "reason": "This HTS code serves as a functional fallback if the garment, although cotton and knitted, fails to meet the specific requirements or definitions of a 'T-shirt' under statistical note 61-1. Rate is 0% under KORUS.", "confidence": 60}]}
{"timestamp": "2025-11-25T20:36:58.124474Z", "product_name": "면티셔츠", "exporter_hs": null, "description": "검정 반팔 면티셔츠", "country_of_origin": "한국", "candidates": [{"hts_code": "6109.10.0010", "title": "T-shirts, singlets, and other vests, knitted or crocheted, of cotton, men's or boys'", "estimated_tariff_rate": "0%", "reason": "The product is a cotton T-shirt, which falls under HTS 6109.10. This specific code covers men's or boys' wear and is one of the most common classifications. The 0% rate is based on the KORUS FTA (Special rate) for Korean origin goods.", "confidence": 95}, {"hts_code": "6109.10.0020", "title": "T-shirts, singlets, and other vests, knitted or crocheted, of cotton, women's or girls'", "estimated_tariff_rate": "0%", "reason": "If the T-shirt is designed for women or girls, this code applies. It shares the base 8-digit heading for cotton T-shirts (6109.10). The 0% rate is based on the KORUS FTA (Special rate) for Korean origin goods.", "confidence": 95}, {"hts_code": "6109.10.0090", "title": "T-shirts, singlets, and other vests, knitted or crocheted, of cotton, other", "estimated_tariff_rate": "0%", "reason": "This is a catch-all classification for cotton T-shirts that do not fit the specific categories for men's/boys' or women's/girls' (e.g., certain generic or special sizes/styles not otherwise specified). The 0% rate applies under the KORUS FTA.", "confidence": 85}]}
{"timestamp": "2025-11-25T22:02:22.332859Z", "product_name": "면티셔츠", "exporter_hs": null, "description": "검정 나일론 면 티셔츠 ", "country_of_origin": "China", "candidates": [{"hts_code": "6109.10.0010", "title": "Men's or boys' T-shirts, knitted, of cotton", "estimated_tariff_rate": "16.5%", "reason": "T-shirts are classified in 6109. This code assumes the cotton component (common for comfort) imparts the essential character of the nylon/cotton blend, and the garment is for a male.", "confidence": 95}, {"hts_code": "6109.10.0019", "title": "Women's or girls' T-shirts, knitted, of cotton", "estimated_tariff_rate": "16.5%", "reason": "This code applies if the cotton component imparts the essential character of the blend, but the garment is specifically designed for a female. The material and construction are otherwise identical to 6109.10.0010.", "confidence": 90}, {"hts_code": "6109.90.1010", "title": "Men's or boys' T-shirts, knitted, of man-made fibers", "estimated_tariff_rate": "32%", "reason": "This code covers the possibility that the nylon component (man-made fiber) is predominant by weight, thus imparting the essential character of the blend (GRI 3b).", "confidence": 85}, {"hts_code": "6109.90.1020", "title": "Women's or girls' T-shirts, knitted, of man-made fibers", "estimated_tariff_rate": "32%", "reason": "This code covers the possibility that the nylon component (man-made fiber) is predominant by weight, and the garment is for a female.", "confidence": 80}]}
{"timestamp": "2025-11-25T22:13:29.523048Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 날 것의 옥수수", "country_of_origin": "China", "candidates": [{"hts_code": "1005.90.2000", "title": "Maize (corn), other than seed corn or popcorn, field corn, yellow or white", "estimated_tariff_rate": "0%", "reason": "This is the primary classification for raw, uncooked maize harvested as grain (field corn), which is the standard interpretation of the product description.", "confidence": 95}, {"hts_code": "1005.90.4000", "title": "Maize (corn), other than seed corn, popcorn", "estimated_tariff_rate": "0%", "reason": "This code applies if the raw maize grain being imported is specifically popcorn. It falls under the general heading for non-seed corn.", "confidence": 80}, {"hts_code": "0709.99.6010", "title": "Sweet corn, fresh or chilled, other", "estimated_tariff_rate": "Variable (e.g., 0.8¢/kg)", "reason": "If 'raw corn' is interpreted as fresh sweet corn intended for direct consumption (on the cob), it is classified as a fresh vegetable under Chapter 7, not as a cereal grain.", "confidence": 70}, {"hts_code": "1005.10.0020", "title": "Corn (maize) seed, hybrid, field corn", "estimated_tariff_rate": "0%", "reason": "This classification is used if the raw corn is specifically intended for planting (seed corn). Although less likely for bulk commercial shipments, it must be considered if planting intent is specified.", "confidence": 55}]}
{"timestamp": "2025-11-25T22:13:48.424669Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 날 것의 식용 옥수수", "country_of_origin": "China", "candidates": [{"hts_code": "1005.90.4000", "title": "Maize (corn), other than seed corn, other than popcorn, other", "estimated_tariff_rate": "0%", "reason": "This HTS code covers raw, field corn/maize kernels that are not intended for planting (seed corn) or popping, fitting the description of uncooked edible corn grain.", "confidence": 85}, {"hts_code": "0709.99.2000", "title": "Fresh or chilled sweet corn (Zea mays var. saccharata)", "estimated_tariff_rate": "0%", "reason": "If the 'uncooked, raw, edible corn' refers to sweet corn being imported fresh or chilled (often on the cob) for human consumption, this Chapter 7 classification is appropriate.", "confidence": 75}, {"hts_code": "0712.90.1000", "title": "Dried sweet corn, whether or not cut, sliced or broken", "estimated_tariff_rate": "4.5%", "reason": "If the corn has been dried for preservation (which is common for export) but remains edible and uncooked, the dried sweet corn classification under HTS 0712 is applicable.", "confidence": 60}]}
{"timestamp": "2025-11-25T22:13:55.975660Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 날 것의 식용 옥수수", "country_of_origin": "China", "candidates": [{"hts_code": "1005.90.6000", "title": "Other maize (corn)", "estimated_tariff_rate": "0%", "reason": "This is the primary residual classification for maize that is not seed, not popcorn, and not yellow dent corn, imported as bulk commodity grain. It covers uncooked, raw, edible corn (other than sweet corn).", "confidence": 95}, {"hts_code": "1005.90.4000", "title": "Yellow dent corn", "estimated_tariff_rate": "0%", "reason": "If the raw corn is the common commodity yellow dent variety (most commonly traded type of bulk feed/food corn), this code applies. (Note: May be subject to a Tariff Rate Quota TRQ, but the General rate is 0%).", "confidence": 85}, {"hts_code": "0709.99.2000", "title": "Sweet corn, fresh or chilled", "estimated_tariff_rate": "0%", "reason": "If the product is intended for use as a vegetable (fresh sweet corn on or off the cob) rather than a commodity grain, it classifies under Chapter 7 (Vegetables). The description '날 것의 식용 옥수수' suggests freshness may be possible.", "confidence": 75}, {"hts_code": "1005.90.2000", "title": "Popcorn", "estimated_tariff_rate": "0%", "reason": "This code applies specifically if the raw corn is of the variety intended for popping. This is included as a distinct possibility under the heading for maize (1005).", "confidence": 60}]}
{"timestamp": "2025-11-25T22:20:59.537720Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 날것의 식용 옥수수", "country_of_origin": "Korea", "candidates": [{"hts_code": "1005.90.8090", "title": "Maize (corn), other than seed, other", "estimated_tariff_rate": "0%", "reason": "The product is raw, uncooked edible corn/maize (옥수수). This 10-digit code covers standard shelled field corn/maize not specifically classified as seed, popcorn, or sweet corn grain.", "confidence": 90}, {"hts_code": "1005.90.6000", "title": "Maize (corn), other than seed; Sweet corn, other than for sowing", "estimated_tariff_rate": "0%", "reason": "If the uncooked, shelled corn kernels are specifically sweet corn (and not fresh on the cob), they fall under this provision for cereal grains.", "confidence": 75}, {"hts_code": "1005.90.2000", "title": "Maize (corn), other than seed; Popcorn", "estimated_tariff_rate": "0%", "reason": "If the 'raw, edible corn' is specifically intended to be popped (Zea mays everta), this classification applies. This is a common form of imported edible dried corn.", "confidence": 60}, {"hts_code": "0709.93.0000", "title": "Vegetables, fresh or chilled; Sweet corn", "estimated_tariff_rate": "2.5%", "reason": "If the product is actually sweet corn sold fresh, on the cob, for immediate consumption, it is classified as a vegetable under Chapter 7 rather than a cereal grain under Chapter 10. The Korean description is ambiguous regarding whether it is shelled or on the cob.", "confidence": 55}]}
{"timestamp": "2025-11-25T22:38:04.225236Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 날것의 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.4000", "title": "Maize (corn), other than seed or popcorn, other", "estimated_tariff_rate": "0%", "reason": "This code covers bulk dry maize (field corn) which is the most commonly traded form of corn grain and is duty-free under the US HTS.", "confidence": 90}, {"hts_code": "0710.40.0000", "title": "Sweet corn, frozen", "estimated_tariff_rate": "14.9%", "reason": "If the 'raw, edible' description refers to sweet corn (Zea mays var. saccharata) kernels, often prepared and frozen for consumption, this specific subheading applies.", "confidence": 85}, {"hts_code": "0709.99.9000", "title": "Other vegetables, fresh or chilled, not elsewhere specified", "estimated_tariff_rate": "4.2%", "reason": "This is a fallback if the corn is imported as fresh/chilled sweet corn on the cob, which is not frozen and not classified as cereal grain.", "confidence": 75}, {"hts_code": "1005.90.1000", "title": "Maize (corn): Popcorn", "estimated_tariff_rate": "0%", "reason": "If the product is a specific type of dry maize known as popcorn (Zea mays everta), this classification must be used, which is also duty-free.", "confidence": 70}]}
{"timestamp": "2025-11-26T00:41:12.530672Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 날것의 식용 옥수수", "country_of_origin": "한구,", "candidates": [{"hts_code": "1005.90.4000", "title": "Maize (corn), other than seed corn, popcorn, or sweet corn; yellow dent corn or flint corn", "estimated_tariff_rate": "0%", "reason": "This is the most common HTS classification for bulk, raw, shelled maize grain intended for food or feed ('옥수수' / corn). Tariff is 0% under General/KR rates.", "confidence": 95}, {"hts_code": "1005.90.6000", "title": "Maize (corn), other than seed corn, popcorn, or sweet corn; sweet corn", "estimated_tariff_rate": "0%", "reason": "If the product is specifically raw sweet corn grain (intended for freezing, canning, or specific consumption) but is classified as a cereal grain (Chapter 10).", "confidence": 85}, {"hts_code": "1005.90.2000", "title": "Popcorn, other than seed corn", "estimated_tariff_rate": "0%", "reason": "Applicable if the variety of corn is intended specifically to be popped. Still raw and uncooked, fitting the description '날것의 옥수수'.", "confidence": 75}, {"hts_code": "0709.99.9040", "title": "Other vegetables, fresh or chilled (e.g., sweet corn on the cob)", "estimated_tariff_rate": "0%", "reason": "Alternative classification if the 'raw, uncooked, edible corn' refers to sweet corn on the cob, classified as a fresh vegetable (Chapter 7), rather than shelled grain (Chapter 10).", "confidence": 60}]}
{"timestamp": "2025-11-26T01:32:07.354676Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 날것의 식용가능 옥수수", "country_of_origin": "한구.", "candidates": [{"hts_code": "1005.90.60", "title": "Maize (corn) (other than seed corn, popcorn, or yellow dent corn)", "estimated_tariff_rate": "0%", "reason": "Most raw edible maize grains not specified as popcorn or dent corn fall here. This covers various food-grade white or sweet corn varieties when dried.", "confidence": 85}, {"hts_code": "0709.99.20", "title": "Sweet corn, fresh or chilled", "estimated_tariff_rate": "3.2%", "reason": "If '날것의' (raw) implies the corn is fresh produce (sweet corn on the cob or shucked kernels, not dried grain), it is classified under fresh vegetables.", "confidence": 75}, {"hts_code": "1005.90.40", "title": "Yellow dent corn, other than seed corn", "estimated_tariff_rate": "0%", "reason": "If the product is standard bulk commodity maize (the most common type globally), regardless of eventual use, it may be classified as yellow dent corn.", "confidence": 70}]}
{"timestamp": "2025-11-26T01:36:59.939723Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 날것의 식용가능 옥수수", "country_of_origin": "한구.", "candidates": [{"hts_code": "1005.90.4000", "title": "Yellow dent corn (other than seed corn)", "estimated_tariff_rate": "0%", "reason": "This HTS covers the majority of raw, dried field maize (corn) imported, falling under the Cereals Chapter (10). It is assumed the corn is dried grain unless specified otherwise.", "confidence": 85}, {"hts_code": "0709.99.1000", "title": "Sweet corn, fresh or chilled", "estimated_tariff_rate": "0%", "reason": "If the 'raw, uncooked edible corn' is sweet corn (often eaten as a vegetable, fresh or on the cob), it would be classified in Chapter 7 as a fresh vegetable.", "confidence": 70}, {"hts_code": "1005.90.9000", "title": "Maize (corn), other than yellow dent corn, popcorn, or seed corn", "estimated_tariff_rate": "0%", "reason": "General basket classification for dried maize that does not fit into the specific categories (e.g., white corn or flint corn).", "confidence": 75}, {"hts_code": "1005.90.6000", "title": "Popcorn (other than seed corn)", "estimated_tariff_rate": "0%", "reason": "If the specific type of raw maize imported is intended solely for popping, this specific classification applies.", "confidence": 60}]}
{"timestamp": "2025-11-26T01:37:03.019869Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 날것의 식용가능 옥수수", "country_of_origin": "한구.", "candidates": [{"hts_code": "1005.90.40", "title": "Maize (corn), other than seed or popcorn", "estimated_tariff_rate": "0%", "reason": "This is the primary classification for raw, unshelled maize grain intended for human consumption or feed, which is not designated as seed or popcorn.", "confidence": 95}, {"hts_code": "0709.99.30", "title": "Sweet corn, fresh or chilled", "estimated_tariff_rate": "0%", "reason": "If the '옥수수' (corn) is specifically sweet corn (consumed as a vegetable) and is shipped fresh or chilled (whether on the cob or shelled), it falls under Chapter 7.", "confidence": 80}, {"hts_code": "1005.90.10", "title": "Popcorn (maize)", "estimated_tariff_rate": "0%", "reason": "If the corn is a specific variety of maize intended for popping (regardless of its current uncooked state), this specific subheading for popcorn would apply.", "confidence": 70}, {"hts_code": "0712.90.55", "title": "Dried sweet corn", "estimated_tariff_rate": "0%", "reason": "If the product is sweet corn that has been dried but not further prepared or milled (e.g., dried kernels), it falls under the dried vegetables heading.", "confidence": 65}]}
{"timestamp": "2025-11-27T05:12:11.545820Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지않은 날것의 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.20.90", "title": "Maize (corn), other than seed or popcorn, yellow dent corn, other", "estimated_tariff_rate": "0%", "reason": "This HTS code covers basic, non-popcorn, non-seed maize (corn) which is the most general classification for cereal grains of corn used for food or feed.", "confidence": 90}, {"hts_code": "0709.93.60.00", "title": "Sweet corn, fresh or chilled, in the husk", "estimated_tariff_rate": "0%", "reason": "If the 'edible corn' is intended to be consumed fresh (e.g., sweet corn), it falls under Chapter 7 (Vegetables). This code assumes it is imported in the typical raw, fresh state (in the husk).", "confidence": 85}, {"hts_code": "0709.93.40.00", "title": "Sweet corn, fresh or chilled, shelled or husked (off the cob)", "estimated_tariff_rate": "0%", "reason": "Applicable if the raw, edible sweet corn is imported fresh or chilled but has been removed from the cob (shelled or husked).", "confidence": 75}, {"hts_code": "1005.90.40.00", "title": "Maize (corn), popcorn", "estimated_tariff_rate": "0%", "reason": "If the corn, though raw and edible, is specifically the type used for popping (Zea mays everta), this classification in Chapter 10 applies.", "confidence": 65}]}
{"timestamp": "2025-11-27T05:12:12.396660Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지않은 날것의 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.6000", "title": "Maize (corn), other than seed corn, popcorn, or sweet corn", "estimated_tariff_rate": "0%", "reason": "This code covers raw maize kernels classified as cereal grains, excluding seed, popcorn, or sweet varieties. This is the most common classification for standard raw field corn.", "confidence": 95}, {"hts_code": "1005.90.4000", "title": "Sweet corn (Zea mays saccharata)", "estimated_tariff_rate": "0%", "reason": "If the uncooked, raw kernels are specifically the sweet corn variety (Zea mays saccharata), which is often used for direct human consumption, this HTS code applies.", "confidence": 85}, {"hts_code": "0709.99.1000", "title": "Sweet corn, fresh or chilled (edible vegetables)", "estimated_tariff_rate": "0%", "reason": "If the corn is imported fresh or chilled, typically on the cob (and not dried kernels/grain), it is classified as a fresh vegetable under Chapter 7, rather than a cereal grain under Chapter 10.", "confidence": 75}, {"hts_code": "1005.90.2000", "title": "Popcorn (Zea mays everta)", "estimated_tariff_rate": "0%", "reason": "This classification applies if the raw corn kernels are specifically of the popping variety (Zea mays everta).", "confidence": 55}]}
{"timestamp": "2025-11-27T05:12:12.559394Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지않은 날것의 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.4040", "title": "Maize (corn), other than seed or popcorn, other than white/yellow dent corn", "estimated_tariff_rate": "0%", "reason": "This code covers shelled maize (corn kernels) that are not specifically white or yellow dent corn, assuming the product is raw, dry kernels (Chapter 10). The general rate is Free.", "confidence": 85}, {"hts_code": "0709.99.2000", "title": "Corn (maize) on the cob, fresh or chilled", "estimated_tariff_rate": "0%", "reason": "The description '날것의 옥수수' (raw corn) suggests it may be fresh produce, such as corn on the cob, classifying it under Chapter 7 (Edible Vegetables).", "confidence": 80}, {"hts_code": "1005.90.6000", "title": "Yellow dent corn, for human consumption", "estimated_tariff_rate": "0%", "reason": "This is a candidate if the imported maize consists of yellow dent kernels intended for consumption (standard classification for many bulk commodity shipments).", "confidence": 70}, {"hts_code": "1005.90.0000", "title": "Maize (corn), other than seed corn (general 8-digit grouping)", "estimated_tariff_rate": "0%", "reason": "A broader 8-digit grouping for 'Maize, other than seed corn' used when the specific type (dent, flint, etc.) is unknown or unspecified. Although US HTS requires 10-digits, this represents the likely heading.", "confidence": 60}]}
{"timestamp": "2025-11-27T05:12:13.213784Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지않은 날것의 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.20", "title": "Maize (corn), other than seed corn or popcorn, for human consumption", "estimated_tariff_rate": "0%", "reason": "This HTS covers raw maize grain specifically intended for human consumption (식용 옥수수). The 0% rate applies under the Korea-US FTA (KR).", "confidence": 95}, {"hts_code": "1005.90.40", "title": "Dent corn, other than seed corn or popcorn, not for human consumption, not elsewhere specified", "estimated_tariff_rate": "0%", "reason": "This is a plausible alternative if the corn is a dent variety or if the final use is determined to be non-human consumption (e.g., industrial or feed), despite the '식용' label. The 0% rate applies under the KORUS FTA.", "confidence": 75}, {"hts_code": "0709.99.20", "title": "Other vegetables, fresh or chilled: Sweet corn", "estimated_tariff_rate": "0%", "reason": "If '옥수수' refers to fresh sweet corn (corn on the cob), it is classified under Chapter 7 (Vegetables) rather than Chapter 10 (Cereals). The 0% rate applies under the KORUS FTA.", "confidence": 70}]}
{"timestamp": "2025-11-27T05:12:13.351773Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지않은 날것의 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.9090", "title": "Maize (corn), other than seed corn, popcorn, or yellow dent corn", "estimated_tariff_rate": "0%", "reason": "This HTS code covers edible raw maize (corn) shipped as a cereal grain that is not specified as yellow dent corn, seed, or popcorn. This is the most general classification for bulk corn shipments.", "confidence": 90}, {"hts_code": "0709.99.0500", "title": "Fresh or chilled sweet corn on the cob", "estimated_tariff_rate": "0%", "reason": "If the 'edible raw corn' refers specifically to fresh sweet corn (a vegetable) intended for direct human consumption, especially if shipped on the cob, it classifies here under fresh vegetables, heading 0709.", "confidence": 85}, {"hts_code": "1005.90.4590", "title": "Yellow dent corn, other than seed corn, not certified organic", "estimated_tariff_rate": "0%", "reason": "This is the classification for the most commonly traded type of field corn (dent corn), used extensively for processing, feed, and many food products. This applies if the variety is yellow dent corn.", "confidence": 75}]}
{"timestamp": "2025-11-27T05:12:14.330481Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 날것의 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.90", "title": "Other maize (corn)", "estimated_tariff_rate": "0%", "reason": "This is the general classification for dried maize grain (field corn/dent corn) when not specifically designated as seed, organic, or popcorn. Assumes the product is dry grain and not fresh/frozen vegetables.", "confidence": 90}, {"hts_code": "0709.99.20.10", "title": "Fresh sweet corn (Zea mays var. saccharata)", "estimated_tariff_rate": "0%", "reason": "If the corn is sweet corn and is shipped fresh (not frozen or dried) for direct human consumption, it is classified as a fresh vegetable under Chapter 7. Tariff rate reflects KORUS FTA.", "confidence": 85}, {"hts_code": "1005.90.50", "title": "Popcorn", "estimated_tariff_rate": "0%", "reason": "If the corn is popcorn, a specific type of raw edible maize, it has its own subheading within Chapter 10.", "confidence": 75}, {"hts_code": "0710.40.00.20", "title": "Sweet corn (Zea mays var. saccharata), frozen", "estimated_tariff_rate": "0%", "reason": "If the 'raw, uncooked' corn is shelled and frozen, it falls under the frozen vegetables heading, which is common for sweet corn intended for the food industry or retail.", "confidence": 70}]}
{"timestamp": "2025-11-27T05:12:14.403173Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지않은 날것의 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.2000", "title": "Yellow dent corn, other than seed corn", "estimated_tariff_rate": "0%", "reason": "This is the primary classification for most unprocessed bulk maize (corn) grain, often referred to as 'field corn'. Since the description indicates 'raw' and 'edible,' this is a high-confidence choice for dried kernel corn.", "confidence": 95}, {"hts_code": "1005.90.4000", "title": "Maize (corn), other than seed, yellow dent, or white", "estimated_tariff_rate": "0%", "reason": "Used as a catch-all for maize grain varieties that are not yellow dent or white (e.g., specific colored or pop corn varieties) when shipped as raw grain.", "confidence": 85}, {"hts_code": "0709.93.4000", "title": "Sweet corn, fresh or chilled, entered during January to June, inclusive", "estimated_tariff_rate": "0%", "reason": "If the 'raw, edible' corn is shipped fresh on the cob (sweet corn), it is classified as a fresh vegetable under Chapter 7. Tariff rate is 0% under the KORUS FTA, regardless of seasonality.", "confidence": 80}]}
{"timestamp": "2025-11-27T05:12:20.300896Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지않은 날것의 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.4080", "title": "Maize (corn), other than seed corn, yellow dent corn", "estimated_tariff_rate": "0%", "reason": "This HTS covers standard shelled, raw field corn (maize) which is the most common commercial cereal variety. The rate is 0% under both the General Rate of Duty and KORUS.", "confidence": 85}, {"hts_code": "1005.90.8080", "title": "Maize (corn), other than seed corn or popcorn, other", "estimated_tariff_rate": "0%", "reason": "Used for shelled maize varieties that are not yellow dent corn, such as flint corn or specific white corn varieties, which fit the description 'raw edible corn'.", "confidence": 80}, {"hts_code": "0709.99.2000", "title": "Fresh or chilled sweet corn, other than sweet peppers", "estimated_tariff_rate": "0%", "reason": "If the 'raw edible corn' is fresh sweet corn (often imported on the cob), it falls under Chapter 7 (Edible Vegetables) rather than Chapter 10 (Cereals).", "confidence": 75}, {"hts_code": "1005.10.0000", "title": "Maize (corn): Seed corn", "estimated_tariff_rate": "0%", "reason": "Although the product is described as 'edible,' this classification must be considered and ruled out, as it covers corn specifically designated for planting.", "confidence": 50}]}
{"timestamp": "2025-11-27T05:13:37.294717Z", "product_name": "옥수수", "exporter_hs": null, "description": "식용옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.40.00", "title": "Maize (corn), other than seed corn, other than yellow dent corn", "estimated_tariff_rate": "0%", "reason": "This classification covers shelled, dried corn kernels (maize) intended for human consumption, excluding common yellow dent corn and seed corn.", "confidence": 90}, {"hts_code": "0709.93.00.00", "title": "Sweet corn (fresh or chilled)", "estimated_tariff_rate": "0%", "reason": "If the edible corn is sweet corn and imported fresh or chilled, it falls under Chapter 7 (Edible Vegetables).", "confidence": 85}, {"hts_code": "0710.40.00.00", "title": "Sweet corn, uncooked or cooked by steaming or boiling in water, frozen", "estimated_tariff_rate": "0%", "reason": "If the edible corn is sweet corn (corn on the cob or kernels) and is imported in a frozen state.", "confidence": 80}, {"hts_code": "1005.90.20.00", "title": "Maize (corn), other than seed corn, yellow dent corn", "estimated_tariff_rate": "0%", "reason": "This covers general bulk yellow dent corn (field corn) which is often used in processed food or sold as feed/commodity, but can also be labeled 'edible'.", "confidence": 75}]}
{"timestamp": "2025-11-27T05:15:32.904688Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지 않은 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.20.00", "title": "Yellow dent corn", "estimated_tariff_rate": "0%", "reason": "This HTS code covers non-seed maize (corn) that is classified as yellow dent, which is the most common commercial type of corn imported as a cereal grain.", "confidence": 90}, {"hts_code": "1005.90.60.00", "title": "Other maize, food grade", "estimated_tariff_rate": "0%", "reason": "Used for edible corn kernels (grain) that are not specifically yellow dent or popcorn, fitting the general description of uncooked edible corn categorized under cereals.", "confidence": 85}, {"hts_code": "0709.99.20.00", "title": "Sweet corn, fresh or chilled", "estimated_tariff_rate": "0%", "reason": "If the 'uncooked edible corn' refers to fresh sweet corn (often on the cob or shelled, but not dried), it is classified under Chapter 7 (Edible Vegetables), rather than Chapter 10 (Cereals).", "confidence": 75}, {"hts_code": "1005.90.40.00", "title": "Popcorn (Zea mays everta)", "estimated_tariff_rate": "0%", "reason": "This is a specific type of edible corn kernel. While possible, this code should only be used if the product is confirmed to be Zea mays everta (popcorn).", "confidence": 60}]}
{"timestamp": "2025-11-27T15:31:34.091019Z", "product_name": "옥수수", "exporter_hs": null, "description": "조리하지않은 날것의 식용 옥수수", "country_of_origin": "한국", "candidates": [{"hts_code": "1005.90.60.00", "title": "Maize (corn), other than seed corn or certified organic", "estimated_tariff_rate": "0%", "reason": "This HTS covers dried corn kernels (maize) when traded as a cereal grain commodity, which is the most common form for large-scale international shipment under Chapter 10.", "confidence": 90}, {"hts_code": "0709.99.20.00", "title": "Sweet corn, fresh or chilled", "estimated_tariff_rate": "1.6¢/kg", "reason": "The description specifies 'raw edible corn,' which may refer to fresh sweet corn, classified as a vegetable under Chapter 7.", "confidence": 75}, {"hts_code": "0710.40.00.00", "title": "Sweet corn, uncooked or cooked by steaming or boiling in water, frozen", "estimated_tariff_rate": "12.8%", "reason": "If the corn is exported raw but preserved by freezing, it falls under Chapter 7 (frozen vegetables).", "confidence": 65}, {"hts_code": "1005.10.00.20", "title": "Seed corn for planting", "estimated_tariff_rate": "0%", "reason": "Covers corn specifically intended for propagation/planting, falling under the specialized classification within Chapter 10.", "confidence": 50}]}
{"timestamp": "2025-11-27T15:32:32.081314Z", "product_name": "990 EVO SSD By Samsung ", "exporter_hs": null, "description": "Samsung SSD", "country_of_origin": "Korea", "candidates": [{"hts_code": "8471.70.4065", "title": "Storage units: Semiconductor media, Solid State Drives (SSDs)", "estimated_tariff_rate": "0%", "reason": "This is the most specific HTS provision for Solid State Drives (SSDs), which are semiconductor media storage units designed for automatic data processing machines.", "confidence": 98}, {"hts_code": "8471.70.4000", "title": "Storage units: Semiconductor media", "estimated_tariff_rate": "0%", "reason": "This is the parent subheading for semiconductor media storage units. SSDs fall squarely within this classification, although 8471.70.4065 is more granular.", "confidence": 95}, {"hts_code": "8473.30.1180", "title": "Parts and accessories suitable for use solely or principally with machines of heading 8471: Printed circuit assemblies", "estimated_tariff_rate": "0%", "reason": "If the SSD is viewed primarily as a Printed Circuit Assembly (PCA) that functions as a part of an ADP machine (8471), this code may apply, though 8471.70 is preferred for storage units.", "confidence": 80}]}
